In [2]:
import pandas as pd

In [4]:
s = pd.Series([10, 20, 30, 40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
data = {
    "Nom": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "Score": [85, 90, 95]
}

In [6]:
df = pd.DataFrame(data)

In [7]:
df

       Nom  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95

In [8]:
df_students = pd.read_csv("students.csv")

In [12]:
df_students.head() # pour les 5 dernières valeurs tail()

   id    prenom     nom                       email  age groupe   note
0   1     Lucie   Marie     lucie.marie@exemple.com   19      A  16.90
1   2     André  Traore    andré.traore@exemple.com   21      A   9.67
2   3    Robert  Moulin   robert.moulin@exemple.com   19      C  16.89
3   4   Maurice    Joly    maurice.joly@exemple.com   19      C  13.06
4   5  Nathalie   Henry  nathalie.henry@exemple.com   18      A  10.62

In [14]:
# df_students["nom"]

In [15]:
# affichez la deuxième ligne du DataFrame

In [18]:
df_students.loc[1] # deuxième ligne l'indice c'est 1

id                               2
prenom                       André
nom                         Traore
email     andré.traore@exemple.com
age                             21
groupe                           A
note                          9.67
Name: 1, dtype: object

In [28]:
print( df_students.loc[:, "prenom"][:2] )

# si on ne connait pas le nom de la colonne
df_students.loc[:, df_students.columns[1]][:2]

0    Lucie
1    André
Name: prenom, dtype: object

0    Lucie
1    André
Name: prenom, dtype: object

In [29]:
df_students.columns[1]

'prenom'

In [37]:
# Trouvez la personne la plus âgé dans le DataFrame
df_students.loc[:, "age"].max()

np.int64(24)

In [45]:
df_students["age"].max()

np.int64(24)

In [48]:
mask = df_students["age"].max()  == df_students["age"]
df_students[mask]

    id  prenom        nom                         email  age groupe   note
6    7  Émilie  Fernandez  émilie.fernandez@exemple.com   24      A  13.39
29  30   Élise      Denis       élise.denis@exemple.com   24      C  13.51

In [42]:
df_students[df_students.loc[:, "age"].max() == df_students.loc[:, "age"] ]

    id  prenom        nom                         email  age groupe   note
6    7  Émilie  Fernandez  émilie.fernandez@exemple.com   24      A  13.39
29  30   Élise      Denis       élise.denis@exemple.com   24      C  13.51

In [50]:
df_students[ df_students["age"] > 20 ]

,id,prenom,nom,email,age,groupe,note
1,2,André,Traore,andré.traore@exemple.com,21,A,9.67
6,7,Émilie,Fernandez,émilie.fernandez@exemple.com,24,A,13.39
7,8,Jeanne,Briand,jeanne.briand@exemple.com,22,A,17.11
9,10,Éric,Carpentier,éric.carpentier@exemple.com,22,A,10.58
10,11,Nicolas,Bodin,nicolas.bodin@exemple.com,23,A,9.11
12,13,Gabrielle,Philippe,gabrielle.philippe@exemple.com,22,A,16.76
14,15,Martine,Morvan,martine.morvan@exemple.com,22,C,15.42
15,16,Astrid,Vasseur,astrid.vasseur@exemple.com,23,C,10.31
17,18,Roger,Robert,roger.robert@exemple.com,22,A,18.26
19,20,Marthe,Briand,marthe.briand@exemple.com,23,A,12.44
20,21,Zacharie,Lopes,zacharie.lopes@exemple.com,21,C,11.20
22,23,Paulette,Marques,paulette.marques@exemple.com,21,A,13.55
23,24,François,Morin,françois.morin@exemple.com,22,C,16.26
24,25,Alex,Pereira,alex.pereira@exemple.com,21,C,11.89
26,27,Josette,Aubry,josette.aubry@exemple.com,23,B,11.21
27,28,Susan,Bertrand,susan.bertrand@exemple.com,21,C,18.52
28,29,Nathalie,Jacques,nathalie.jacques@exemple.com,23,A,15.87
29,30,Élise,Denis,élise.denis@exemple.com,24,C,13.51

In [51]:
df_students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      30 non-null     int64
 1   prenom  30 non-null     object
 2   nom     30 non-null     object
 3   email   30 non-null     object
 4   age     30 non-null     int64
 5   groupe  30 non-null     object
 6   note    30 non-null     float64
dtypes: float64(1), int64(2), object(4)
memory usage: 1.8+ KB

In [52]:
df_students.describe()

              id        age       note
count  30.000000  30.000000  30.000000
mean   15.500000  20.866667  13.795667
std     8.803408   1.888866   3.055553
min     1.000000  18.000000   8.950000
25%     8.250000  19.000000  11.202500
50%    15.500000  21.000000  13.450000
75%    22.750000  22.000000  16.635000
max    30.000000  24.000000  18.520000

In [54]:
data = {
    "produit": ["A", "B", "C", "D"],
    "prix": [10, 15, 7, 20],
    "quantité": [5, 3, 10, 2]
}
df = pd.DataFrame(data)
print(df)
df["total"] = df["prix"] * df["quantité"]
print(df)

somme_totale = df["total"].sum()
print("Somme totale des ventes :", somme_totale)

  produit  prix  quantité
0       A    10         5
1       B    15         3
2       C     7        10
3       D    20         2
  produit  prix  quantité  total
0       A    10         5     50
1       B    15         3     45
2       C     7        10     70
3       D    20         2     40
Somme totale des ventes : 205

In [55]:
ventes = pd.DataFrame({
    "ville": ["Paris", "Lyon", "Paris", "Marseille", "Lyon"],
    "produit": ["A", "B", "A", "C", "C"],
    "montant": [100, 200, 150, 300, 250]
})

groupes = ventes.groupby("ville")["montant"].sum()

In [56]:
groupes

ville
Lyon         450
Marseille    300
Paris        250
Name: montant, dtype: int64

In [57]:
ventes.groupby("ville")["montant"]